[
  {
    "title": "Apple's Push Into AI Allegedly Happened After Craig Federighi Tried Microsoft AI Coding Tool",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/KYBqSF_tK_R0DKRO2wCP59ShDPs=/800x0/article-new/2024/04/iOS-18-Siri-Integrated-Feature.jpg?lossy",
    "body": "In a report on Apple's AI ambitions, WSJ says that Federighi became an AI convert after testing the Copilot coding tool introduced by Microsoft-owned GitHub. Copilot, which uses OpenAI technology, was created to help programmers write, troubleshoot, and translate code into different programming languages. After playing around with GitHub Copilot in December of 2022, Federighi explained that he had come to appreciate generative AI, and he reportedly tasked engineering employees with creating new ways to integrate AI features into Apple's apps and features. Prior rumors have suggested that Apple is aiming to integrate AI into as many apps as possible with ‌iOS 18‌ and future software updates. Apple accelerated development on internal generative AI development, even recruiting some former Apple Car employees to work on the technology, but it has also held discussions with OpenAI and Google and is expected to rely on both its internal AI models and external partnerships. Rumors about features coming in ‌iOS 18‌ indicate that Federighi has been successful in incorporating AI into the operating system in a number of ways, with Apple planning to add AI features to Messages, Mail, Photos, and other key apps. Siri will also be overhauled with generative AI, making the personal assistant smarter and more capable.",
    "categories": [
      "Apple"
    ]
  },
  {
    "title": "Netflix Testing Major Apple TV App Redesign",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/M7ojJhq6LromG7Ebh8YX1U1GdcA=/800x0/article-new/2024/06/netflix-app-update.jpg?lossy",
    "body": "Customers were reportedly performing eye gymnastics looking around to different parts of the home screen in an attempt to find a show or movie to watch, so Netflix wanted to simplify the navigation experience. We really wanted members to have an easier time figuring out if a title is right for them, Netflix senior director of product Pat Flemming told The Verge. The static tiles for TV shows and movies are being replaced with tiles that extend when the remote lands on them, making information like the trailer and description more centralized. Right now, when scrolling through content, show or movie information is displayed at the top of the screen. With the updated interface, that information is shown in the middle of the display, and tiles for other shows are pushed to the side. Hovering over a TV show or movie for an extended period of time will cause a short preview to automatically start playing. Netflix plans to replace the left side navigation menu with a top bar menu that features search, home, shows, movies, and My Netflix, with the menu accessible by pressing the back button on the remote. The current Categories and New and Popular tabs will be removed, but New and Popular will be replaced with the My Netflix recommendations, and Categories will be available from the search tab. The new design is being tested with a small group of subscribers to begin with, but it will be expanded to additional Netflix users in the coming months if it proves to be a popular change.",
    "categories": [
      "Apple"
    ]
  },
  {
    "title": "Review: Three Weeks With the M2 iPad Air",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/AZS1ESyFAJx8cBfggzdRE4nsLjM=/800x0/article-new/2024/06/M2-Air-Review-Thumb-1.jpg?lossy",
    "body": "The ‌iPad Air‌ is the best iPad for people who want a powerful tablet that's also fairly affordable. The M2 chip is close to the same chip that Apple used in the prior-generation ‌iPad Pro‌, and while it's a little older now, it's still more than powerful enough for anything you might want to do on a tablet. It is worth noting that Apple recently admitted an error and clarified that the ‌M2‌ chip in the ‌iPad Air‌ has a 9-core GPU instead of a 10-core GPU, but in comparing the ‌M2‌ ‌iPad Pro‌ with 10-core GPU to the ‌M2‌ ‌iPad Air‌ with 9-core GPU, there was basically no difference in performance for day-to-day tasks and even with more system intensive apps like those used for video editing. As we said in our M4 ‌iPad Pro‌ review, there's nothing that can really tax the M4 chip, and that's also true of the ‌M2‌. With iPadOS 18 and the AI capabilities that Apple is working on, chip performance might become much more important in the future, but as of now, the ‌M2‌ ‌iPad Air‌ isn't going to really struggle with anything you throw at it. The ‌iPad Air‌ doesn't have the OLED display technology of the ‌iPad Pro‌, and it lacks features like ProMotion 120Hz refresh rates, but it otherwise offers a lot of the features you get with the ‌iPad Pro‌ at much more affordable prices. The ‌iPad Pro‌ starts at $999, while the ‌iPad Air‌ starts at $599. Face ID is not available on the ‌iPad Air‌, with Apple instead using a Touch ID power button. ‌Touch ID‌ isn't as reliable as ‌Face ID‌ because it can fail depending on finger placement, but it works fine for the most part. The ‌iPad Pro‌ has a Thunderbolt port, but the ‌iPad Air‌ is limited to USB-C, so you can't connect Thunderbolt devices. You're mostly missing out on OLED and the M4 chip with the ‌iPad Pro‌, but you also won't be able to use the redesigned Magic Keyboard that Apple made for the ‌iPad Pro‌ because it isn't compatible with the ‌iPad Air‌. Apple is selling the older Magic Keyboard alongside the ‌iPad Air‌, and it lacks the aluminum frame and palm rest, function keys, and the larger glass trackpad. You can still use the Apple Pencil Pro and all of its features with the ‌iPad Air‌, though. One of the nice features about the ‌iPad Air‌ compared to prior-generation models is the relocated front-facing camera, which is now on the landscape edge instead of the portrait edge. That means the camera is in an upright orientation when it's in landscape mode, such as when connected to a keyboard, so it no longer looks funny if you're FaceTiming while holding the ‌iPad‌ horizontally. The ‌M2‌ ‌iPad Air‌ is essentially an ‌M2‌ ‌iPad Pro‌ without the higher-quality display, and it's a good middle tier option if you want solid performance for futureproofing but also don't want to spend $1,000+ on a tablet. For a lot of people who just want a tablet for browsing the web, sending emails, and other simple day-to-day tasks, the ‌iPad Air‌ may even be overkill.",
    "categories": [
      "Apple"
    ]
  },
  {
    "title": "iOS 18: Apple Mail App May Help You Compose and Reply to Your Emails",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/_8HthLD5t25C8eBbKbBkoAhxYE0=/800x0/article-new/2024/03/Generic-iOS-18-Feature-Purple.jpg?lossy",
    "body": "According to a new report from AppleInsider, results returned when performing a Mail search will be beefed up to include additional information from Contacts, locations, and locally stored documents. Meanwhile, Smart Replies will rely on Apple's on-device large-language model (LLM), internally known as Ajax. Combined with Siri's deep integration with Mail and the virtual assistant's ability to create replies on the fly at the user's request, Smart Replies are being developed to streamline communication and save time. Associated with the new Mail features is a new system-wide writing tools framework that could enable text editing via ‌Siri‌. The framework is apparently included in pre-release versions of ‌iOS 18‌, iPadOS 18, and macOS 15. Although little is known about its implementation, the report claims that it could help change the style or tone of the user's text as they type an email or message. If a user wanted to sound less casual, for example, they could ask ‌Siri‌ to Make this text more professional. The report offers a number of other tidbits related to Project BlackPearl – Apple's codename for some cross-system AI and machine learning enhancements – including automatic email categorization based on content (e.g. time sensitivity), ability to summarize emails and email threads, as well as notification summaries based on topic. Bloomberg's Mark Gurman has previously touched on many of the other rumored new AI features mentioned in the report that are coming to ‌iOS 18‌ and ‌macOS 15‌. You can find more details about them in our previous coverage.",
    "categories": [
      "Apple"
    ]
  },
  {
    "title": "iOS 18: Apple Mail App May Help You Compose and Reply to Your Emails",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/6Sr0Ua_kRFTjgGnwZMUBK3uL2WY=/800x0/article-new/2024/06/iphone-in-a-box.jpg?lossy",
    "body": "Earlier this year, the U.K. established new Product Security and Telecommunications Infrastructure (PSTI) regulations, which force companies that sell internet-capable products in the country to comply with certain security requirements. One of the requirements of the PSTI is that companies define a support period, or minimum length of time, for which security updates will be provided after sale. A security update is defined by the regulation as a software update that protects or enhances the security of a product, including a software update that addresses security issues which have been discovered by or reported to the manufacturer. In compliance with the regulation, Apple has submitted a public regulatory filing for the iPhone 15 Pro Max. The PSTI filing shows that the device's defined support period is a minimum five years from the first supply date. The first supply date is listed as September 22, 2023, which is when the iPhone 15 series launched. Unlike Samsung and Google, Apple is not usually explicit about its legacy software support for iPhone devices, so the five-year minimum should come as good news to Apple users holding onto older devices. However, as Android Authority notes, both Samsung and Google guarantee seven years of security updates as well as Android OS updates for their devices, which is two years longer than what Apple is guaranteeing here. That said, Apple typically provides older devices with the latest security updates longer than the stated five-year period. For example, just this March Apple pushed a security update to iPhone 6s models, which launched in September 2015, or nine years ago. Going back further, in November 2020, Apple released an update to patch major security issues for the ‌iPhone‌ 5S, which was released in 2013. That's seven years after the device went on sale. In other words, while the minimum-five year period is now set in stone, iPhone users can take comfort in the fact that Apple has a strong history of keeping legacy devices in the loop for several years longer.",
    "categories": [
      "Apple"
    ]
  },
  {
    "title": "Google Adds RCS Feature for Texting 911",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://images.macrumors.com/t/Ef6uZGMiRSKm9A_wk24zM7Ouo64=/800x0/article-new/2024/06/google-emergency-services-rcs.jpg?lossy",
    "body": "When it is not possible to call 911, Android users will be able to send a text instead to get emergency help. The texting feature will provide precise location information to emergency responders, and it will let users send high-resolution photos and videos. Texting 911 will be available to U.S. Android device owners who use Google Messages, but because it is a feature baked into ‌RCS‌, it could also expand to other devices like the iPhone. Later this year, Apple plans to adopt ‌RCS‌ to replace SMS/MMS. The option to text 911 via ‌RCS‌ will roll out to emergency call centers across the United States starting this winter. In some places, it is already possible to text 911 over SMS, but not all emergency call centers support the technology. Google is aiming to bring texting to all call centers, and to improve the ability to send photos and videos with ‌RCS‌. Google says ‌RCS‌ for emergency 911 texts will bring the following benefits:",
    "categories": [
      "Android"
    ]
  },
  {
    "title": "Best Buy Geek Squad can't fix your Samsung phone anymore",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.androidauthority.com/wp-content/uploads/2020/06/Best-Buy-stock-photo-840w-472h.jpg.webp",
    "body": "Samsung phone owners might be disappointed to learn that the company’s repair partnership with Best Buy has come to an end. This change ends Best Buy’s status as an authorized service provider (ASP) for Samsung, meaning they can’t use genuine Samsung parts, tools, or training anymore. The news initially surfaced on a Geek Squad subreddit, where employees discussed the discontinuation of the program. The Verge then confirmed the news with a Best Buy insider who shared an internal memo announcing the end of the Samsung ASP program at all locations.",
    "categories": [
      "Android"
    ]
  },
  {
    "title": "Qualcomm could split Snapdragon 8 Gen 5 production between Samsung and TSMC",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.androidauthority.com/wp-content/uploads/2023/10/Snapdragon-8-Gen-3-reference-device-edit-e1698325751209-840w-472h.jpg.webp",
    "body": "Qualcomm might be shaking things up with its next-generation Snapdragon 8 Gen 5 chip, teaming up with both Samsung and TSMC to manufacture it. This tidbit came from Qualcomm CEO Cristiano Amon during a media briefing in Taiwan on June 4, as reported by Business Korea. During the briefing, Amon responded to a question about the risks of relying on a single manufacturer by suggesting of a partnership with both Samsung and TSMC for future chip fabrication. He did not elaborate on the specific reasons behind this shift, but it’s likely driven by a combination of factors, including cost considerations, the desire to diversify manufacturing partners, and confidence in Samsung’s recent advancements in chip manufacturing. Qualcomm had previously collaborated with Samsung on the Snapdragon 888 and Snapdragon 8 Gen 1 chips, but those collaborations resulted in some of the most thermally inefficient and battery-hogging Android flagships in recent memory. Qualcomm switched back to TSMC for the Snapdragon 8+ Gen 1 and subsequent generations, leading to a much-needed improvement in battery life and thermal performance for Android flagships.",
    "categories": [
      "Android"
    ]
  },
  {
    "title": "Your Galaxy Phone will soon let you peek the time with a back tap",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.androidauthority.com/wp-content/uploads/2024/02/Galaxy-S24-Plus-8-840w-472h.jpg.webp",
    "body": "As spotted by tipster Tarun Vats, Samsung is working on an update for the RegiStar module in the Good Lock app. This update will introduce a function the development team calls “Check Time with Back Tap.” For context, RegiStar is a module for Good Lock that allows you to assign functions to a double-tap gesture on the back of your phone. For example, you could make it so that a screenshot is taken when you tap on the back of your phone twice. It’s not much different from the Quick Tap feature you get on a Pixel phone.",
    "categories": [
      "Android"
    ]
  },
  {
    "title": "Windows 10 gets its first beta preview in three years",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2024/06/Windows10Pro.jpg?resize=1024%2C576&quality=50&strip=all",
    "body": "The bell is tolling for Windows 10, with the much-loved operating system going out of official support in October of next year. But with hundreds of millions of users still on the older version (and many refusing to upgrade), it looks like Microsoft has a few improvements left to make. A new beta version just dropped for Windows Insiders. It’s the first time Windows 10 has been given a beta build since 2021, as Bleeping Computer notes. While Windows 10 betas have certainly been made for the last three years, they’ve only been tested internally by Microsoft before hitting the general release. A company blog post notes that some of the new (last?) features the OS is getting will require more broad testing.",
    "categories": [
      "Windows"
    ]
  },
  {
    "title": "This Windows 11 trick brings back Windows 10’s file explorer",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2024/06/shutterstock_2138503559.jpg?resize=1024%2C576&quality=50&strip=all",
    "body": "Windows 10 continues to enjoy overwhelming popularity as an operating system, not least because many users prefer its features and designs to Windows 11. In addition to the changed taskbar, Start menu, and many other new features, many users also don’t like the new File Explorer in Windows 11. Fortunately, there is a simple trick to bring back the old design from Windows 10. To open the old File Explorer, all you have to do is go to your PC’s Control Panel and then switch to System and Security. There, select Windows Tools, which will automatically display the Windows File Explorer interface.",
    "categories": [
      "Windows"
    ]
  },
  {
    "title": "Microsoft battens security hatches on Windows admin accounts",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2024/05/ColorBloom-2.jpg?resize=1024%2C640&quality=50&strip=all",
    "body": "In Windows, an admin account has full access and control over your entire operating system, which is exactly what hackers hope for when sending malware out into the world. If you’re on a Windows account that’s allowed to install programs, then malicious apps will have an easier time taking root in your PC. And so, for years, the going advice has been to avoid a Windows administrator account for day-to-day use, since funny business could happen unbeknownst to you in the background.",
    "categories": [
      "Windows"
    ]
  },
  {
    "title": "You can now limit how much memory Microsoft Edge uses",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2024/05/Microsoft-Edge.jpg?resize=1024%2C683&quality=50&strip=all",
    "body": "Microsoft has released version 125 of the Microsoft Edge browser and it’s an intriguing one with more news than usual. One of the most interesting additions is a new slider that lets you decide how much working memory Edge is allowed to use, which could be a key reason that pushes you to consider switching from Chrome to Edge. The slider ranges from 1GB to 16GB (or whatever amount of memory you have on your computer) and can be found in the browser settings.",
    "categories": [
      "Windows"
    ]
  },
  {
    "title": "Cooler Master’s Motion 1 haptic gaming chair gets your body in the game",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2023/05/CoolerMaster-Reveal-Twitter-1.jpg?resize=1024%2C576&quality=50&strip=all",
    "body": "As the video game industry continues its inevitable march towards complete immersive technology, one of the leading frontiers is haptics. Currently though, outside of boutique VR accessories and the smartwatch on your wrist, haptics are still a relatively unexplored technology in personal electronics. But that’s about to change thanks to a collaborative effort from D-Box and Cooler Master. Hoping to make haptics more than just a video game gimmick, the two companies have combined to build what might just be the future of in-home entertainment.",
    "categories": [
      "Gear"
    ]
  },
  {
    "title": "Witness the Acer Predator Thronos",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2023/04/predator-thronos-100770056-orig.jpg?resize=1024%2C683&quality=50&strip=all",
    "body": "The Predator Thronos reclines up to 140 degrees, giving you plenty of room to lay back and soak in your games across up to three 27-inch displays. And if that doesn’t sound immersive enough, the chair vibrates when you’re hit in-game, which sounds similar to the haptic feedback you get with controllers. Acer’s clearly envisioning the Predator Thronos as the, uh, throne of gamers who live and breathe the brand. “Integrated with a Predator PC and triple Predator monitors plus gadgets, the Thronos becomes more than a gaming chair—it’s a gamer’s cave,” the press release says. A gamer’s cave. Think of it like jacking into the Matrix, but without all the metal bits inserted in your skull, maybe? Anyway, like I said, this is more of a simstation rig than a gaming chair you’d buy from the likes of",
    "categories": [
      "Gear"
    ]
  },
  {
    "title": "An Autonomous standing desk could change your home office routine forever",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2023/04/J3IR8sP.jpeg?resize=1024%2C683&quality=50&strip=all",
    "body": "Founded in 2015, Autonomous has launched a full line of practical, functional, and minimalist office furniture they call the most advanced and ergonomic desks and chairs on the market. And there’s no more apt example of the Autonomous philosophy than their flagship SmartDesk standing desk models. At first glance, it’s as unobtrusive as you’d expect, a remarkably sturdy, yet classic design that comes in a pair of varieties: the standard SmartDesk Core, and the even more powerful SmartDesk Pro. The Core size starts at $499, with the Pro size beginning at $699. With desktops crafted from a warp-proof medium density fiberboard (MDF) and surfaces ranging from basic black and white to more elegant wood grains for ultimate customization, either model fits into virtually any room decor. That even includes the wraparound SmartDesk Corner edition, which extends over six feet long for maximum workspace.",
    "categories": [
      "Gear"
    ]
  },
  {
    "title": "Razer is bringing RGB to N95 masks, because why not?",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2023/04/razer-project-hazel-100872974-orig.jpg?resize=1024%2C639&quality=50&strip=all",
    "body": "The recyclable Project Hazel mask features a transparent external face shield as well as a flexible silicone lining that conforms to the user’s face and mouth. On each side of the face, a pair of replaceable N95 “smart pods” will provide filtration capabilities. Razer designed the vents as an active ventilation systems, with the ability to control the airflow in and out of the mask, Scharnikow said. And it’s the transparent face shield that points to one of the problems that Razer is trying to solve: the limits on social interaction of wearing a mask. The transparent face shield was designed to allow people you’re talking with to be able to see your facial expression, as well as to allow those who can read lips to be able to see your mouth. Razer has also gone further: inside the mask, subtle LED lights illuminate your mouth at night, too.",
    "categories": [
      "Gear"
    ]
  },
  {
    "title": "Kensington Pro Fit Ergo Wireless Keyboard review",
    "author": "John Doe",
    "published": "2023-03-14T12:00:00Z",
    "image": "https://www.pcworld.com/wp-content/uploads/2023/04/pro-fit-ergo-hero-100817710-orig.jpg?resize=1024%2C682&quality=50&strip=all",
    "body": "The Pro Fit Ergo Wireless Keyboard joins standing desks and ergonomic chairs as another means of defense against the beating our bodies take at the office. Its “ergonomist-approved design” (quirkily shaped, as you’d expect) involves a learning curve—especially if you’re a touch typist. But if you can stick with it, it presumably provides relief for those who have repetitive stress injures, and an ounce of prevention for those who don’t yet.",
    "categories": [
      "Gear"
    ]
  }
]